[net]
# Training
# batch=128
# subdivisions=4

# Testing
batch=1
subdivisions=1

height=256
width=256
max_crop=448
channels=3
momentum=0.9
decay=0.0005

burn_in=1000
learning_rate=0.1
policy=poly
power=4
max_batches=16000

angle=7
hue=.1
saturation=.75
exposure=.75
aspect=.75

# layer-0
# down-1
[convolutional]
batch_normalize=1
filters=64
size=7
stride=2
pad=1
activation=leaky

# layer-1
# down-2
[maxpool]
size=2
stride=2

# layer-2
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-3
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-4
[route]
layers=-1,-3

# layer-5
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-6
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-7
[route]
layers=-1,-3

# layer-8
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-9
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-10
[route]
layers=-1,-3

# layer-11
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-12
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-13
[route]
layers=-1,-3

# layer-14
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-15
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-16
[route]
layers=-1,-3

# layer-17
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-18
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-19
[route]
layers=-1,-3

# layer-20
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-21
# down-3
[maxpool]
size=2
stride=2

# layer-22
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-23
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-24
[route]
layers=-1,-3

# layer-25
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-26
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-27
[route]
layers=-1,-3

# layer-28
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-29
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-30
[route]
layers=-1,-3

# layer-31
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-32
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-33
[route]
layers=-1,-3

# layer-34
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-35
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-36
[route]
layers=-1,-3

# layer-37
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-38
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-39
[route]
layers=-1,-3

# layer-40
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-41
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-42
[route]
layers=-1,-3

# layer-43
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-44
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-45
[route]
layers=-1,-3

# layer-46
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-47
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-48
[route]
layers=-1,-3

# layer-49
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-50
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-51
[route]
layers=-1,-3

# layer-52
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-53
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-54
[route]
layers=-1,-3

# layer-55
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-56
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-57
[route]
layers=-1,-3

# layer-58
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# layer-59
# down-4
[maxpool]
size=2
stride=2

# layer-60
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-61
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-62
[route]
layers=-1,-3

# layer-63
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-64
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-65
[route]
layers=-1,-3

# layer-66
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-67
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-68
[route]
layers=-1,-3

# layer-69
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-70
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-71
[route]
layers=-1,-3

# layer-72
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-73
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-74
[route]
layers=-1,-3

# layer-75
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-76
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-77
[route]
layers=-1,-3

# layer-78
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-79
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-80
[route]
layers=-1,-3

# layer-81
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-82
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-83
[route]
layers=-1,-3

# layer-84
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-85
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-86
[route]
layers=-1,-3

# layer-87
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-88
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-89
[route]
layers=-1,-3

# layer-90
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-91
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-92
[route]
layers=-1,-3

# layer-93
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-94
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-95
[route]
layers=-1,-3

# layer-96
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-97
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-98
[route]
layers=-1,-3

# layer-99
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-100
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-101
[route]
layers=-1,-3

# layer-102
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-103
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-104
[route]
layers=-1,-3

# layer-105
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-106
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-107
[route]
layers=-1,-3

# layer-108
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-109
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-110
[route]
layers=-1,-3

# layer-111
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-112
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-113
[route]
layers=-1,-3

# layer-114
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-115
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-116
[route]
layers=-1,-3

# layer-117
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-118
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-119
[route]
layers=-1,-3

# layer-120
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-121
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-122
[route]
layers=-1,-3

# layer-123
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-124
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-125
[route]
layers=-1,-3

# layer-126
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-127
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-128
[route]
layers=-1,-3

# layer-129
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-130
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-131
[route]
layers=-1,-3

# layer-132
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-133
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-134
[route]
layers=-1,-3

# layer-135
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-136
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-137
[route]
layers=-1,-3

# layer-138
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-139
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-140
[route]
layers=-1,-3

# layer-141
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-142
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-143
[route]
layers=-1,-3

# layer-144
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-145
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-146
[route]
layers=-1,-3

# layer-147
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-148
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-149
[route]
layers=-1,-3

# layer-150
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-151
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-152
[route]
layers=-1,-3

# layer-153
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-154
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-155
[route]
layers=-1,-3

# layer-156
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-157
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-158
[route]
layers=-1,-3

# layer-159
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-160
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-161
[route]
layers=-1,-3

# layer-162
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-163
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-164
[route]
layers=-1,-3

# layer-165
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-166
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-167
[route]
layers=-1,-3

# layer-168
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-169
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-170
[route]
layers=-1,-3

# layer-171
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-172
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-173
[route]
layers=-1,-3

# layer-174
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-175
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-176
[route]
layers=-1,-3

# layer-177
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-178
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-179
[route]
layers=-1,-3

# layer-180
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-181
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-182
[route]
layers=-1,-3

# layer-183
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-184
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-185
[route]
layers=-1,-3

# layer-186
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-187
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-188
[route]
layers=-1,-3

# layer-189
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-190
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-191
[route]
layers=-1,-3

# layer-192
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-193
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-194
[route]
layers=-1,-3

# layer-195
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-196
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-197
[route]
layers=-1,-3

# layer-198
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-199
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-200
[route]
layers=-1,-3

# layer-201
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-202
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-203
[route]
layers=-1,-3

# layer-204
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

# layer-205
# down-5
[maxpool]
size=2
stride=2

# layer-206
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-207
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-208
[route]
layers=-1,-3

# layer-209
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-210
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-211
[route]
layers=-1,-3

# layer-212
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-213
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-214
[route]
layers=-1,-3

# layer-215
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-216
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-217
[route]
layers=-1,-3

# layer-218
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-219
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-220
[route]
layers=-1,-3

# layer-221
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-222
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-223
[route]
layers=-1,-3

# layer-224
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-225
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-226
[route]
layers=-1,-3

# layer-227
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-228
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-229
[route]
layers=-1,-3

# layer-230
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-231
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-232
[route]
layers=-1,-3

# layer-233
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-234
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-235
[route]
layers=-1,-3

# layer-236
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-237
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-238
[route]
layers=-1,-3

# layer-239
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-240
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-241
[route]
layers=-1,-3

# layer-242
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-243
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-244
[route]
layers=-1,-3

# layer-245
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-246
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-247
[route]
layers=-1,-3

# layer-248
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-249
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-250
[route]
layers=-1,-3

# layer-251
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-252
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-253
[route]
layers=-1,-3

# layer-254
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-255
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-256
[route]
layers=-1,-3

# layer-257
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-258
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-259
[route]
layers=-1,-3

# layer-260
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-261
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-262
[route]
layers=-1,-3

# layer-263
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-264
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-265
[route]
layers=-1,-3

# layer-266
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-267
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-268
[route]
layers=-1,-3

# layer-269
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-270
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-271
[route]
layers=-1,-3

# layer-272
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-273
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-274
[route]
layers=-1,-3

# layer-275
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-276
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-277
[route]
layers=-1,-3

# layer-278
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-279
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-280
[route]
layers=-1,-3

# layer-281
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-282
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-283
[route]
layers=-1,-3

# layer-284
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-285
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-286
[route]
layers=-1,-3

# layer-287
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-288
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-289
[route]
layers=-1,-3

# layer-290
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-291
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-292
[route]
layers=-1,-3

# layer-293
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-294
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-295
[route]
layers=-1,-3

# layer-296
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-297
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-298
[route]
layers=-1,-3

# layer-299
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# layer-300
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# layer-301
[route]
layers=-1,-3


# layer-302
[convolutional]
filters=1000
size=1
stride=1
pad=1
activation=linear

### backbone ###

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
activation=leaky
from=-2

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear


[yolo]
mask = 3,4,5
anchors = 12,17, 14,17, 15,19, 15,21, 13,20, 19,24
#10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[shortcut]
activation=leaky
from=204
# from 7 to 204

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[shortcut]
activation=leaky
from=-3

[shortcut]
activation=leaky
from=204
# from 7 to 204

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 1,2,3
anchors = 12,17, 14,17, 15,19, 15,21, 13,20, 19,24
#10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0
